app/controllers/admin_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`company_id` = 1 AND `posts`.`delete_flag` = 0  ORDER BY update_time desc
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 4 AND `comments`.`delete_flag` = 0
SELECT `kudos`.* FROM `kudos` WHERE `kudos`.`post_id` = 4 AND `kudos`.`delete_flag` = 0
---
  def index
    @company_posts = {}
    @company_lists.each do |company|
      posts = Post.where(:company_id => company.id, :delete_flag => 0).order("update_time desc")

      @posts = []
      data = {}

      posts.each do |post|
        comments = Comment.where(:post_id => post.id, :delete_flag => 0)
        kudos = Kudos.where(:post_id => post.id, :delete_flag => 0)

SELECT COUNT(*) FROM `company`
SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `posts`
SELECT SUM(`posts`.`points`) FROM `posts`
SELECT COUNT(*) FROM `kudos`
SELECT COUNT(*) FROM `comments`
---
  def overall
    @company_lists = Company.all.count
    @users = User.order("company_id").count
    @total_posts = Post.all.count
    @total_points = Post.sum(:points)
    @total_kudos = Kudos.all.count
    @total_comments = Comment.all.count